app/controllers/rounds_controller.rb

INSERT INTO "rounds" ("player_choice", "computer_choice", "result", "created_at", "updated_at", "user_id") VALUES ('gun', 'snake', 'Win', '2025-08-21 12:10:27.202298', '2025-08-21 12:10:27.202298', 1) RETURNING "id"
---
  def create
    player_choice = params[:choice].to_s.downcase
    unless Round::CHOICES.include?(player_choice)
      redirect_to root_path, alert: "Invalid choice." and return
    end

    computer_choice = Round::CHOICES.sample
    result = Round.decide(player_choice, computer_choice)

    @round = current_user.rounds.build(
      player_choice: player_choice,
      computer_choice: computer_choice,
      result: result
      )

    if @round.save

SELECT "rounds".* FROM "rounds" ORDER BY "rounds"."created_at" DESC LIMIT 20
SELECT COUNT(*) AS "count_all", "rounds"."result" AS "rounds_result" FROM "rounds" GROUP BY "rounds"."result"
---
  def index
    @recent_rounds = current_user.rounds.order(created_at: :desc).limit(20)
    @scores = current_user.rounds.group(:result).count
    @choice_counts = current_user.rounds.group(:player_choice).count

SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = 1 LIMIT 1
---
  def show
    @round = Round.find(params[:id])

SELECT COUNT(*) AS "count_all", "rounds"."result" AS "rounds_result" FROM "rounds" GROUP BY "rounds"."result"
SELECT COUNT(*) AS "count_all", "rounds"."player_choice" AS "rounds_player_choice" FROM "rounds" GROUP BY "rounds"."player_choice"
---
  def index
    # Show recent rounds and simple leaderboard counts
    @recent_rounds = Round.order(created_at: :desc).limit(20)
    @scores = Round.group(:result).count
    # also compute top choices statistics (optional)
    @choice_counts = Round.group(:player_choice).count